INSERT INTO company(company_id) VALUES (1);
insert into USERS(user_id) values(2);

INSERT INTO outgoing (outgoing_id, company_id, outgoing_date, outgoing_state, partial_outgoing,customer_name) VALUES
                                                                                                    (1, 1, '2024-07-27', 'PENDING', true,'스리랑'),
                                                                                                    (2, 1, '2024-07-28', 'PENDING', false,'아리랑'),
                                                                                                    (3, 1, '2024-07-29', 'PENDING', true,'아리랑'),
                                                                                                    (4, 1, '2024-07-30', 'PENDING', false,'아리랑'),
                                                                                                    (5, 1, '2024-07-31', 'PENDING', true,'아리랑'),
                                                                                                    (6, 1, '2024-08-01', 'PENDING', false,'아리랑'),
                                                                                                    (7, 1, '2024-08-02', 'PENDING', true,'아리랑'),
                                                                                                    (8, 1, '2024-08-03', 'PENDING', false,'아리랑'),
                                                                                                    (9, 1, '2024-08-04', 'PENDING', true,'아리랑'),
                                                                                                    (10, 1, '2024-08-05', 'PENDING', false,'아리랑'),
                                                                                                    (11, 1, '2024-08-06', 'PENDING', true,'아리랑'),
                                                                                                    (12, 1, '2024-08-07', 'PENDING', false,'아리랑'),
                                                                                                    (13, 1, '2024-08-08', 'PENDING', true,'아리랑'),
                                                                                                    (14, 1, '2024-08-09', 'PENDING', false,'아리랑'),
                                                                                                    (15, 1, '2024-08-10', 'PENDING', true,'아리랑'),
                                                                                                    (16, 1, '2024-08-11', 'PENDING', false,'아리랑'),
                                                                                                    (17, 1, '2024-08-12', 'PENDING', true,'아리랑'),
                                                                                                    (18, 1, '2024-08-13', 'PENDING', false,'아리랑'),
                                                                                                    (19, 1, '2024-08-14', 'PENDING', true,'아리랑'),
                                                                                                    (20, 1, '2024-08-15', 'PENDING', false,'아리랑');

INSERT INTO outgoing_detail (detail_id, price, product_name, outgoing_id, quantity) values (1,10000,'광어',1,20),
                                                                                           (2,10000,'넙치',1,20),
                                                                                           (3,10000,'갈치',1,20),
                                                                                           (4,10000,'고등어',1,20);

INSERT INTO inventories (inventory_id, company_id, quantity, incoming_price, category, name, country, incoming_date, natural_status) VALUES
                                                                                                                                (1, 101, 60, 7000, '활어', '광어', '국산', '2024-07-23', '자연'),
                                                                                                                                (2, 101, 60, 7000, '활어', '우럭', '국산', '2024-07-03', '양식'),
                                                                                                                                (3, 101, 60, 7000, '선어', '광어', '국산', '2024-07-17', '자연'),
                                                                                                                                (4, 101, 30, 5000, '활어', '우럭', '일본', '2024-07-12', '자연'),
                                                                                                                                (5, 101, 16, 2100, '선어', '광어', '국산', '2024-07-31', '자연'),
                                                                                                                                (6, 101, 10, 3300, '선어', '광어', '국산', '2024-07-22', '자연'),
                                                                                                                                (7, 101, 17, 7000, '활어', '우럭', '국산', '2024-07-28', '양식'),
                                                                                                                                (8, 101, 60, 7000, '활어', '광어', '국산', '2024-07-03', '자연'),
                                                                                                                                (9, 101, 60, 7000, '활어', '광어', '국산', '2024-07-17', '자연'),
                                                                                                                                (10, 101, 60, 7000, '활어', '숭어', '국산', '2024-07-23', '양식'),
                                                                                                                                (11, 101, 60, 7000, '활어', '광어', '국산', '2024-07-23', '자연'),
                                                                                                                                (12, 101, 60, 7000, '활어', '광어', '국산', '2024-07-31', '자연'),
                                                                                                                                (13, 101, 10, 4000, '활어', '민어', '국산', '2024-07-28', '자연'),
                                                                                                                                (14, 101, 60, 7000, '활어', '광어', '국산', '2024-07-22', '자연'),
                                                                                                                                (15, 101, 60, 7000, '활어', '우럭', '국산', '2024-07-12', '자연'),
                                                                                                                                (16, 101, 60, 7000, '활어', '광어', '국산', '2024-07-31', '자연'),
                                                                                                                                (17, 101, 60, 7000, '활어', '광어', '국산', '2024-07-17', '자연'),
                                                                                                                                (18, 101, 60, 7000, '활어', '장어', '일본', '2024-07-23', '자연'),
                                                                                                                                (19, 101, 60, 7000, '활어', '광어', '국산', '2024-07-31', '자연'),
                                                                                                                                (20, 101, 40, 3400, '활어', '문어', '국산', '2024-07-03', '자연'),
                                                                                                                                (21, 101, 23, 10000, '활어', '장어', '국산', '2024-07-03', '양식');
